LaloAlvarez-e/MSP430F169/MSP430F169_DriverLib/DriverLib/ADC12/Peripheral/RegisterDefines/Header/ADC12_RegisterDefines_IE.h
/**
 *
 * @file ADC12_RegisterDefines_IE.h
 * @copyright
 * @verbatim InDeviceMex 2021 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 20 abr. 2022 @endverbatim
 *
 * @author
 * @verbatim InDeviceMex @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 20 abr. 2022     InDeviceMex    1.0         initial Version@endverbatim
 */

#ifndef DRIVERLIB_ADC12_PERIPHERAL_REGISTERDEFINES_HEADER_ADC12_REGISTERDEFINES_IE_H_
#define DRIVERLIB_ADC12_PERIPHERAL_REGISTERDEFINES_HEADER_ADC12_REGISTERDEFINES_IE_H_

#include "DriverLib/MCU/Header/MCU_Common.h"

/******************************************************************************************
 ************************************ 3 IE *********************************************
 ******************************************************************************************/
/*-----------*/
#define ADC12_IE_R_CH0_BIT ((uint16_t) 0U)

#define ADC12_IE_CH0_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH0_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH0_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH0_MASK (ADC12_IE_CH0_MASK << ADC12_IE_R_CH0_BIT)
#define ADC12_IE_R_CH0_DIS (ADC12_IE_CH0_DIS << ADC12_IE_R_CH0_BIT)
#define ADC12_IE_R_CH0_ENA (ADC12_IE_CH0_ENA << ADC12_IE_R_CH0_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH1_BIT ((uint16_t) 1U)

#define ADC12_IE_CH1_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH1_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH1_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH1_MASK (ADC12_IE_CH1_MASK << ADC12_IE_R_CH1_BIT)
#define ADC12_IE_R_CH1_DIS (ADC12_IE_CH1_DIS << ADC12_IE_R_CH1_BIT)
#define ADC12_IE_R_CH1_ENA (ADC12_IE_CH1_ENA << ADC12_IE_R_CH1_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH2_BIT ((uint16_t) 2U)

#define ADC12_IE_CH2_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH2_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH2_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH2_MASK (ADC12_IE_CH2_MASK << ADC12_IE_R_CH2_BIT)
#define ADC12_IE_R_CH2_DIS (ADC12_IE_CH2_DIS << ADC12_IE_R_CH2_BIT)
#define ADC12_IE_R_CH2_ENA (ADC12_IE_CH2_ENA << ADC12_IE_R_CH2_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH3_BIT ((uint16_t) 3U)

#define ADC12_IE_CH3_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH3_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH3_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH3_MASK (ADC12_IE_CH3_MASK << ADC12_IE_R_CH3_BIT)
#define ADC12_IE_R_CH3_DIS (ADC12_IE_CH3_DIS << ADC12_IE_R_CH3_BIT)
#define ADC12_IE_R_CH3_ENA (ADC12_IE_CH3_ENA << ADC12_IE_R_CH3_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH4_BIT ((uint16_t) 4U)

#define ADC12_IE_CH4_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH4_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH4_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH4_MASK (ADC12_IE_CH4_MASK << ADC12_IE_R_CH4_BIT)
#define ADC12_IE_R_CH4_DIS (ADC12_IE_CH4_DIS << ADC12_IE_R_CH4_BIT)
#define ADC12_IE_R_CH4_ENA (ADC12_IE_CH4_ENA << ADC12_IE_R_CH4_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH5_BIT ((uint16_t) 5U)

#define ADC12_IE_CH5_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH5_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH5_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH5_MASK (ADC12_IE_CH5_MASK << ADC12_IE_R_CH5_BIT)
#define ADC12_IE_R_CH5_DIS (ADC12_IE_CH5_DIS << ADC12_IE_R_CH5_BIT)
#define ADC12_IE_R_CH5_ENA (ADC12_IE_CH5_ENA << ADC12_IE_R_CH5_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH6_BIT ((uint16_t) 6U)

#define ADC12_IE_CH6_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH6_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH6_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH6_MASK (ADC12_IE_CH6_MASK << ADC12_IE_R_CH6_BIT)
#define ADC12_IE_R_CH6_DIS (ADC12_IE_CH6_DIS << ADC12_IE_R_CH6_BIT)
#define ADC12_IE_R_CH6_ENA (ADC12_IE_CH6_ENA << ADC12_IE_R_CH6_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH7_BIT ((uint16_t) 7U)

#define ADC12_IE_CH7_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH7_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH7_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH7_MASK (ADC12_IE_CH7_MASK << ADC12_IE_R_CH7_BIT)
#define ADC12_IE_R_CH7_DIS (ADC12_IE_CH7_DIS << ADC12_IE_R_CH7_BIT)
#define ADC12_IE_R_CH7_ENA (ADC12_IE_CH7_ENA << ADC12_IE_R_CH7_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH8_BIT ((uint16_t) 8U)

#define ADC12_IE_CH8_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH8_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH8_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH8_MASK (ADC12_IE_CH8_MASK << ADC12_IE_R_CH8_BIT)
#define ADC12_IE_R_CH8_DIS (ADC12_IE_CH8_DIS << ADC12_IE_R_CH8_BIT)
#define ADC12_IE_R_CH8_ENA (ADC12_IE_CH8_ENA << ADC12_IE_R_CH8_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH9_BIT ((uint16_t) 9U)

#define ADC12_IE_CH9_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH9_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH9_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH9_MASK (ADC12_IE_CH9_MASK << ADC12_IE_R_CH9_BIT)
#define ADC12_IE_R_CH9_DIS (ADC12_IE_CH9_DIS << ADC12_IE_R_CH9_BIT)
#define ADC12_IE_R_CH9_ENA (ADC12_IE_CH9_ENA << ADC12_IE_R_CH9_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH10_BIT ((uint16_t) 10U)

#define ADC12_IE_CH10_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH10_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH10_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH10_MASK (ADC12_IE_CH10_MASK << ADC12_IE_R_CH10_BIT)
#define ADC12_IE_R_CH10_DIS (ADC12_IE_CH10_DIS << ADC12_IE_R_CH10_BIT)
#define ADC12_IE_R_CH10_ENA (ADC12_IE_CH10_ENA << ADC12_IE_R_CH10_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH11_BIT ((uint16_t) 11U)

#define ADC12_IE_CH11_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH11_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH11_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH11_MASK (ADC12_IE_CH11_MASK << ADC12_IE_R_CH11_BIT)
#define ADC12_IE_R_CH11_DIS (ADC12_IE_CH11_DIS << ADC12_IE_R_CH11_BIT)
#define ADC12_IE_R_CH11_ENA (ADC12_IE_CH11_ENA << ADC12_IE_R_CH11_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH12_BIT ((uint16_t) 12U)

#define ADC12_IE_CH12_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH12_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH12_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH12_MASK (ADC12_IE_CH12_MASK << ADC12_IE_R_CH12_BIT)
#define ADC12_IE_R_CH12_DIS (ADC12_IE_CH12_DIS << ADC12_IE_R_CH12_BIT)
#define ADC12_IE_R_CH12_ENA (ADC12_IE_CH12_ENA << ADC12_IE_R_CH12_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH13_BIT ((uint16_t) 13U)

#define ADC12_IE_CH13_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH13_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH13_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH13_MASK (ADC12_IE_CH13_MASK << ADC12_IE_R_CH13_BIT)
#define ADC12_IE_R_CH13_DIS (ADC12_IE_CH13_DIS << ADC12_IE_R_CH13_BIT)
#define ADC12_IE_R_CH13_ENA (ADC12_IE_CH13_ENA << ADC12_IE_R_CH13_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH14_BIT ((uint16_t) 14U)

#define ADC12_IE_CH14_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH14_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH14_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH14_MASK (ADC12_IE_CH14_MASK << ADC12_IE_R_CH14_BIT)
#define ADC12_IE_R_CH14_DIS (ADC12_IE_CH14_DIS << ADC12_IE_R_CH14_BIT)
#define ADC12_IE_R_CH14_ENA (ADC12_IE_CH14_ENA << ADC12_IE_R_CH14_BIT)
/*-----------*/

/*-----------*/
#define ADC12_IE_R_CH15_BIT ((uint16_t) 15U)

#define ADC12_IE_CH15_MASK ((uint16_t) 0x01U)
#define ADC12_IE_CH15_DIS ((uint16_t) 0x00U)
#define ADC12_IE_CH15_ENA ((uint16_t) 0x01U)

#define ADC12_IE_R_CH15_MASK (ADC12_IE_CH15_MASK << ADC12_IE_R_CH15_BIT)
#define ADC12_IE_R_CH15_DIS (ADC12_IE_CH15_DIS << ADC12_IE_R_CH15_BIT)
#define ADC12_IE_R_CH15_ENA (ADC12_IE_CH15_ENA << ADC12_IE_R_CH15_BIT)
/*-----------*/

#endif /* DRIVERLIB_ADC12_PERIPHERAL_REGISTERDEFINES_HEADER_ADC12_REGISTERDEFINES_IE_H_ */
